# R语言中的四类统计分布函数
# R语言中提供了四类有关统计分布的函数（密度函数，累计分布函数，分位函数，随机数函数）。分别在代表该分布的R函数前加上相应前缀获得(d，p，q，r)。如：
# 
# 1）正态分布的函数是norm，命令dnorm(0)就可以获得正态分布的密度函数在0处的值(0.3989)(默认为标准正态分布)。
# 
# 2）同理，pnorm(0)是0.5就是正态分布的累计密度函数在0处的值。
# 
# 3）而qnorm(0.5)则得到的是0，即标准正态分布在0.5处的分位数是0（在来个比较常用的：qnorm(0.975)就是那个估计中经常用到的1.96了）。
# 
# 4）最后一个rnorm(n)则是按正态分布随机产生n个数据。
# 
# 
# 上面正态分布的参数平均值和方差都是默认的0和１，你可以通过在函数里显示指定这些参数对其进行更改。如dnorm(0, 1, 2)则得出的是均值为1，标准差为2的正态分布在0处的概率值。
# 
# 要注意的是()内的顺序不能颠倒。


#  导入数据
w <- read.table("clipboard",T)
# dnorm函数解释：dnorm(0,1,2)则得出的是均值为1，标准差为2的正态分布在0处的概率值
# 计算P(男性|身高=6∩体重=130∩脚掌=8)值
p=dnorm(6,mean(w[w$性别=='男',2]),sd(w[w$性别=='男',2]))*
  dnorm(130,mean(w[w$性别=='男',3]),sd(w[w$性别=='男',3]))*
  dnorm(8,mean(w[w$性别=='男',4]),sd(w[w$性别=='男',4]))
# 计算P(女性|身高=6∩体重=130∩脚掌=8)值
q=dnorm(6,mean(w[w$性别=='女',2]),sd(w[w$性别=='女',2]))*
  dnorm(130,mean(w[w$性别=='女',3]),sd(w[w$性别=='女',3]))*
  dnorm(8,mean(w[w$性别=='女',4]),sd(w[w$性别=='女',4]))
q/(p+q)

